app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "One"], ["description", "The first product"], ["image", ""], ["price", 50.0], ["created_at", "2017-06-10 01:08:19.394960"], ["updated_at", "2017-06-10 01:08:19.394960"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 215.5], ["updated_at", "2017-06-15 01:52:08.034548"], ["id", 17]]